using System;
using System.Collections.Generic;
using Unity.VisualScripting;

public static class JapaneseCharUtil
{
    private static readonly Dictionary<char, char> NextMap = new()
    {
        // ひらがな
        { 'あ', 'ぁ' }, { 'ぁ', 'あ' },
        { 'い', 'ぃ' }, { 'ぃ', 'い' },
        { 'う', 'ぅ' }, { 'ぅ', 'ゔ' }, { 'ゔ', 'う' },
        { 'え', 'ぇ' }, { 'ぇ', 'え' },
        { 'お', 'ぉ' }, { 'ぉ', 'お' },

        { 'や', 'ゃ' }, { 'ゃ', 'や' },
        { 'ゆ', 'ゅ' }, { 'ゅ', 'ゆ' },
        { 'よ', 'ょ' }, { 'ょ', 'よ' },

        { 'つ', 'っ' }, { 'っ', 'づ' }, { 'づ', 'つ' },
        { 'わ', 'ゎ' }, { 'ゎ', 'わ' },

        { 'か', 'が' }, { 'が', 'か' },
        { 'き', 'ぎ' }, { 'ぎ', 'き' },
        { 'く', 'ぐ' }, { 'ぐ', 'く' },
        { 'け', 'げ' }, { 'げ', 'け' },
        { 'こ', 'ご' }, { 'ご', 'こ' },

        { 'さ', 'ざ' }, { 'ざ', 'さ' },
        { 'し', 'じ' }, { 'じ', 'し' },
        { 'す', 'ず' }, { 'ず', 'す' },
        { 'せ', 'ぜ' }, { 'ぜ', 'せ' },
        { 'そ', 'ぞ' }, { 'ぞ', 'そ' },

        { 'た', 'だ' }, { 'だ', 'た' },
        { 'ち', 'ぢ' }, { 'ぢ', 'ち' },
        { 'て', 'で' }, { 'で', 'て' },
        { 'と', 'ど' }, { 'ど', 'と' },

        { 'は', 'ば' }, { 'ば', 'ぱ' }, { 'ぱ', 'は' },
        { 'ひ', 'び' }, { 'び', 'ぴ' }, { 'ぴ', 'ひ' },
        { 'ふ', 'ぶ' }, { 'ぶ', 'ぷ' }, { 'ぷ', 'ふ' },
        { 'へ', 'べ' }, { 'べ', 'ぺ' }, { 'ぺ', 'へ' },
        { 'ほ', 'ぼ' }, { 'ぼ', 'ぽ' }, { 'ぽ', 'ほ' },

        // カタカナ
        { 'ア', 'ァ' }, { 'ァ', 'ア' },
        { 'イ', 'ィ' }, { 'ィ', 'イ' },
        { 'ウ', 'ゥ' }, { 'ゥ', 'ヴ' }, { 'ヴ', 'ウ' },
        { 'エ', 'ェ' }, { 'ェ', 'エ' },
        { 'オ', 'ォ' }, { 'ォ', 'オ' },

        { 'ヤ', 'ャ' }, { 'ャ', 'ヤ' },
        { 'ユ', 'ュ' }, { 'ュ', 'ユ' },
        { 'ヨ', 'ョ' }, { 'ョ', 'ヨ' },

        { 'ツ', 'ッ' }, { 'ッ', 'ヅ' }, { 'ヅ', 'ツ' },
        { 'ワ', 'ヮ' }, { 'ヮ', 'ワ' },

        { 'カ', 'ガ' }, { 'ガ', 'カ' },
        { 'キ', 'ギ' }, { 'ギ', 'キ' },
        { 'ク', 'グ' }, { 'グ', 'ク' },
        { 'ケ', 'ゲ' }, { 'ゲ', 'ケ' },
        { 'コ', 'ゴ' }, { 'ゴ', 'コ' },

        { 'サ', 'ザ' }, { 'ザ', 'サ' },
        { 'シ', 'ジ' }, { 'ジ', 'シ' },
        { 'ス', 'ズ' }, { 'ズ', 'ス' },
        { 'セ', 'ゼ' }, { 'ゼ', 'セ' },
        { 'ソ', 'ゾ' }, { 'ゾ', 'ソ' },

        { 'タ', 'ダ' }, { 'ダ', 'タ' },
        { 'チ', 'ヂ' }, { 'ヂ', 'チ' },
        { 'テ', 'デ' }, { 'デ', 'テ' },
        { 'ト', 'ド' }, { 'ド', 'ト' },

        { 'ハ', 'バ' }, { 'バ', 'パ' }, { 'パ', 'ハ' },
        { 'ヒ', 'ビ' }, { 'ビ', 'ピ' }, { 'ピ', 'ヒ' },
        { 'フ', 'ブ' }, { 'ブ', 'プ' }, { 'プ', 'フ' },
        { 'ヘ', 'ベ' }, { 'ベ', 'ペ' }, { 'ペ', 'ヘ' },
        { 'ホ', 'ボ' }, { 'ボ', 'ポ' }, { 'ポ', 'ホ' },
    };

    public static bool TryGetNextVariation(char input, out char result)
    {
        return NextMap.TryGetValue(input, out result);
    }
}